/* automatically generated by rust-bindgen 0.59.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn set_bit(&mut self, index: usize, val: bool) {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = &mut self.storage.as_mut()[byte_index];
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        if val {
            *byte |= mask;
        } else {
            *byte &= !mask;
        }
    }
    #[inline]
    pub fn get(&self, bit_offset: usize, bit_width: u8) -> u64 {
        debug_assert!(bit_width <= 64);

pub const INTLVI_vect: u32 = 6;
pub const INTP0_vect: u32 = 8;
pub const INTP1_vect: u32 = 10;
pub const INTP2_vect: u32 = 12;
pub const INTP3_vect: u32 = 14;
pub const INTP4_vect: u32 = 16;
pub const INTP5_vect: u32 = 18;
pub const INTCSI20_vect: u32 = 20;
pub const INTIIC20_vect: u32 = 20;
pub const INTST2_vect: u32 = 20;
pub const INTCSI21_vect: u32 = 22;
pub const INTIIC21_vect: u32 = 22;
pub const INTSR2_vect: u32 = 22;
pub const INTSRE2_vect: u32 = 24;
pub const INTTM11H_vect: u32 = 24;
pub const INTDMA0_vect: u32 = 26;
pub const INTDMA1_vect: u32 = 28;
pub const INTCSI00_vect: u32 = 30;
pub const INTIIC00_vect: u32 = 30;
pub const INTST0_vect: u32 = 30;
pub const INTCSI01_vect: u32 = 32;
pub const INTIIC01_vect: u32 = 32;
pub const INTSR0_vect: u32 = 32;
pub const INTSRE0_vect: u32 = 34;
pub const INTTM01H_vect: u32 = 34;
pub const INTCSI10_vect: u32 = 36;
pub const INTIIC10_vect: u32 = 36;
pub const INTST1_vect: u32 = 36;
pub const INTCSI11_vect: u32 = 38;
pub const INTIIC11_vect: u32 = 38;
pub const INTSR1_vect: u32 = 38;
pub const INTSRE1_vect: u32 = 40;
pub const INTTM03H_vect: u32 = 40;
pub const INTIICA0_vect: u32 = 42;
pub const INTTM00_vect: u32 = 44;
pub const INTTM01_vect: u32 = 46;
pub const INTTM02_vect: u32 = 48;
pub const INTTM03_vect: u32 = 50;
pub const INTAD_vect: u32 = 52;
pub const INTRTC_vect: u32 = 54;
pub const INTIT_vect: u32 = 56;
pub const INTKR_vect: u32 = 58;
pub const INTCSI30_vect: u32 = 60;
pub const INTIIC30_vect: u32 = 60;
pub const INTST3_vect: u32 = 60;
pub const INTCSI31_vect: u32 = 62;
pub const INTIIC31_vect: u32 = 62;
pub const INTSR3_vect: u32 = 62;
pub const INTTM13_vect: u32 = 64;
pub const INTTM04_vect: u32 = 66;
pub const INTTM05_vect: u32 = 68;
pub const INTTM06_vect: u32 = 70;
pub const INTTM07_vect: u32 = 72;
pub const INTP6_vect: u32 = 74;
pub const INTP7_vect: u32 = 76;
pub const INTP8_vect: u32 = 78;
pub const INTP9_vect: u32 = 80;
pub const INTP10_vect: u32 = 82;
pub const INTP11_vect: u32 = 84;
pub const INTTM10_vect: u32 = 86;
pub const INTTM11_vect: u32 = 88;
pub const INTTM12_vect: u32 = 90;
pub const INTSRE3_vect: u32 = 92;
pub const INTTM13H_vect: u32 = 92;
pub const INTMD_vect: u32 = 94;
pub const INTIICA1_vect: u32 = 96;
pub const INTFL_vect: u32 = 98;
pub const INTDMA2_vect: u32 = 100;
pub const INTDMA3_vect: u32 = 102;
pub const INTTM14_vect: u32 = 104;
pub const INTTM15_vect: u32 = 106;
pub const INTTM16_vect: u32 = 108;
pub const INTTM17_vect: u32 = 110;
pub const BRK_I_vect: u32 = 126;
pub const OPTION_BYTES_vect: u32 = 192;
pub const SECURITY_ID_vect: u32 = 196;
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p0 {
    pub p0: cty::c_uchar,
    pub BIT: un_p0__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p0__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p0__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p0__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p0__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p0__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p0__bindgen_ty_1))
    );
}
impl un_p0__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p0() {
    assert_eq!(
        ::core::mem::size_of::<un_p0>(),
        1usize,
        concat!("Size of: ", stringify!(un_p0))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p0>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p0))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p0>())).p0 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p0), "::", stringify!(p0))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p0>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p0),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p1 {
    pub p1: cty::c_uchar,
    pub BIT: un_p1__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p1__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p1__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p1__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p1__bindgen_ty_1))
    );
}
impl un_p1__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p1() {
    assert_eq!(
        ::core::mem::size_of::<un_p1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p1>())).p1 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p1), "::", stringify!(p1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p1>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p1),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p2 {
    pub p2: cty::c_uchar,
    pub BIT: un_p2__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p2__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p2__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p2__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p2__bindgen_ty_1))
    );
}
impl un_p2__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p2() {
    assert_eq!(
        ::core::mem::size_of::<un_p2>(),
        1usize,
        concat!("Size of: ", stringify!(un_p2))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p2>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p2>())).p2 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p2), "::", stringify!(p2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p2>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p2),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p3 {
    pub p3: cty::c_uchar,
    pub BIT: un_p3__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p3__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p3__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p3__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p3__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p3__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p3__bindgen_ty_1))
    );
}
impl un_p3__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p3() {
    assert_eq!(
        ::core::mem::size_of::<un_p3>(),
        1usize,
        concat!("Size of: ", stringify!(un_p3))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p3>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p3>())).p3 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p3), "::", stringify!(p3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p3>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p3),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p4 {
    pub p4: cty::c_uchar,
    pub BIT: un_p4__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p4__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p4__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p4__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p4__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p4__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p4__bindgen_ty_1))
    );
}
impl un_p4__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p4() {
    assert_eq!(
        ::core::mem::size_of::<un_p4>(),
        1usize,
        concat!("Size of: ", stringify!(un_p4))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p4>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p4))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p4>())).p4 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p4), "::", stringify!(p4))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p4>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p4),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p5 {
    pub p5: cty::c_uchar,
    pub BIT: un_p5__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p5__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p5__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p5__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p5__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p5__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p5__bindgen_ty_1))
    );
}
impl un_p5__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p5() {
    assert_eq!(
        ::core::mem::size_of::<un_p5>(),
        1usize,
        concat!("Size of: ", stringify!(un_p5))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p5>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p5))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p5>())).p5 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p5), "::", stringify!(p5))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p5>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p5),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p6 {
    pub p6: cty::c_uchar,
    pub BIT: un_p6__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p6__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p6__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p6__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p6__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p6__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p6__bindgen_ty_1))
    );
}
impl un_p6__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p6() {
    assert_eq!(
        ::core::mem::size_of::<un_p6>(),
        1usize,
        concat!("Size of: ", stringify!(un_p6))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p6>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p6))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p6>())).p6 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p6), "::", stringify!(p6))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p6>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p6),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p7 {
    pub p7: cty::c_uchar,
    pub BIT: un_p7__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p7__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p7__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p7__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p7__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p7__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p7__bindgen_ty_1))
    );
}
impl un_p7__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p7() {
    assert_eq!(
        ::core::mem::size_of::<un_p7>(),
        1usize,
        concat!("Size of: ", stringify!(un_p7))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p7>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p7))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p7>())).p7 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p7), "::", stringify!(p7))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p7>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p7),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p8 {
    pub p8: cty::c_uchar,
    pub BIT: un_p8__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p8__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p8__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p8__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p8__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p8__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p8__bindgen_ty_1))
    );
}
impl un_p8__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p8() {
    assert_eq!(
        ::core::mem::size_of::<un_p8>(),
        1usize,
        concat!("Size of: ", stringify!(un_p8))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p8>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p8))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p8>())).p8 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p8), "::", stringify!(p8))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p8>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p8),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p9 {
    pub p9: cty::c_uchar,
    pub BIT: un_p9__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p9__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p9__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p9__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p9__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p9__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p9__bindgen_ty_1))
    );
}
impl un_p9__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p9() {
    assert_eq!(
        ::core::mem::size_of::<un_p9>(),
        1usize,
        concat!("Size of: ", stringify!(un_p9))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p9>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p9))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p9>())).p9 as *const _ as usize },
        0usize,
        concat!("Offset of field: ", stringify!(un_p9), "::", stringify!(p9))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p9>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p9),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p10 {
    pub p10: cty::c_uchar,
    pub BIT: un_p10__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p10__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p10__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p10__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p10__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p10__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p10__bindgen_ty_1))
    );
}
impl un_p10__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p10() {
    assert_eq!(
        ::core::mem::size_of::<un_p10>(),
        1usize,
        concat!("Size of: ", stringify!(un_p10))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p10>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p10))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p10>())).p10 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p10),
            "::",
            stringify!(p10)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p10>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p10),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p11 {
    pub p11: cty::c_uchar,
    pub BIT: un_p11__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p11__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p11__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p11__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p11__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p11__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p11__bindgen_ty_1))
    );
}
impl un_p11__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p11() {
    assert_eq!(
        ::core::mem::size_of::<un_p11>(),
        1usize,
        concat!("Size of: ", stringify!(un_p11))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p11>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p11))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p11>())).p11 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p11),
            "::",
            stringify!(p11)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p11>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p11),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p12 {
    pub p12: cty::c_uchar,
    pub BIT: un_p12__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p12__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p12__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p12__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p12__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p12__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p12__bindgen_ty_1))
    );
}
impl un_p12__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p12() {
    assert_eq!(
        ::core::mem::size_of::<un_p12>(),
        1usize,
        concat!("Size of: ", stringify!(un_p12))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p12>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p12))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p12>())).p12 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p12),
            "::",
            stringify!(p12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p12>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p12),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p13 {
    pub p13: cty::c_uchar,
    pub BIT: un_p13__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p13__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p13__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p13__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p13__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p13__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p13__bindgen_ty_1))
    );
}
impl un_p13__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p13() {
    assert_eq!(
        ::core::mem::size_of::<un_p13>(),
        1usize,
        concat!("Size of: ", stringify!(un_p13))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p13>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p13))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p13>())).p13 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p13),
            "::",
            stringify!(p13)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p13>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p13),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p14 {
    pub p14: cty::c_uchar,
    pub BIT: un_p14__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p14__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p14__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p14__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p14__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p14__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p14__bindgen_ty_1))
    );
}
impl un_p14__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p14() {
    assert_eq!(
        ::core::mem::size_of::<un_p14>(),
        1usize,
        concat!("Size of: ", stringify!(un_p14))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p14>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p14))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p14>())).p14 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p14),
            "::",
            stringify!(p14)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p14>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p14),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_p15 {
    pub p15: cty::c_uchar,
    pub BIT: un_p15__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_p15__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_p15__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_p15__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_p15__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p15__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p15__bindgen_ty_1))
    );
}
impl un_p15__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_p15() {
    assert_eq!(
        ::core::mem::size_of::<un_p15>(),
        1usize,
        concat!("Size of: ", stringify!(un_p15))
    );
    assert_eq!(
        ::core::mem::align_of::<un_p15>(),
        1usize,
        concat!("Alignment of ", stringify!(un_p15))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p15>())).p15 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p15),
            "::",
            stringify!(p15)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_p15>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_p15),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sdr00 {
    pub sdr00: cty::c_ushort,
    pub BIT: un_sdr00__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_sdr00__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_sdr00__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr00__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr00__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr00__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr00__bindgen_ty_1))
    );
}
impl un_sdr00__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sdr00() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr00>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr00))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr00>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr00))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr00>())).sdr00 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr00),
            "::",
            stringify!(sdr00)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr00>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr00),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sio00 {
    pub sio00: cty::c_uchar,
    pub BIT: un_sio00__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_sio00__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_sio00__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sio00__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio00__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio00__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio00__bindgen_ty_1))
    );
}
impl un_sio00__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sio00() {
    assert_eq!(
        ::core::mem::size_of::<un_sio00>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio00))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio00>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio00))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio00>())).sio00 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio00),
            "::",
            stringify!(sio00)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio00>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio00),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_txd0 {
    pub txd0: cty::c_uchar,
    pub BIT: un_txd0__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_txd0__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_txd0__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_txd0__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_txd0__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_txd0__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_txd0__bindgen_ty_1))
    );
}
impl un_txd0__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_txd0() {
    assert_eq!(
        ::core::mem::size_of::<un_txd0>(),
        1usize,
        concat!("Size of: ", stringify!(un_txd0))
    );
    assert_eq!(
        ::core::mem::align_of::<un_txd0>(),
        1usize,
        concat!("Alignment of ", stringify!(un_txd0))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_txd0>())).txd0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_txd0),
            "::",
            stringify!(txd0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_txd0>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_txd0),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sdr01 {
    pub sdr01: cty::c_ushort,
    pub BIT: un_sdr01__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_sdr01__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_sdr01__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr01__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr01__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr01__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr01__bindgen_ty_1))
    );
}
impl un_sdr01__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sdr01() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr01>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr01))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr01>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr01))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr01>())).sdr01 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr01),
            "::",
            stringify!(sdr01)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr01>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr01),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_rxd0 {
    pub rxd0: cty::c_uchar,
    pub BIT: un_rxd0__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_rxd0__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_rxd0__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_rxd0__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_rxd0__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_rxd0__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_rxd0__bindgen_ty_1))
    );
}
impl un_rxd0__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_rxd0() {
    assert_eq!(
        ::core::mem::size_of::<un_rxd0>(),
        1usize,
        concat!("Size of: ", stringify!(un_rxd0))
    );
    assert_eq!(
        ::core::mem::align_of::<un_rxd0>(),
        1usize,
        concat!("Alignment of ", stringify!(un_rxd0))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_rxd0>())).rxd0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_rxd0),
            "::",
            stringify!(rxd0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_rxd0>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_rxd0),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sio01 {
    pub sio01: cty::c_uchar,
    pub BIT: un_sio01__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_sio01__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_sio01__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sio01__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio01__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio01__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio01__bindgen_ty_1))
    );
}
impl un_sio01__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sio01() {
    assert_eq!(
        ::core::mem::size_of::<un_sio01>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio01))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio01>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio01))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio01>())).sio01 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio01),
            "::",
            stringify!(sio01)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio01>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio01),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sdr12 {
    pub sdr12: cty::c_ushort,
    pub BIT: un_sdr12__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_sdr12__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_sdr12__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr12__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr12__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr12__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr12__bindgen_ty_1))
    );
}
impl un_sdr12__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sdr12() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr12>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr12))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr12>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr12))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr12>())).sdr12 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr12),
            "::",
            stringify!(sdr12)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr12>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr12),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sio30 {
    pub sio30: cty::c_uchar,
    pub BIT: un_sio30__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_sio30__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_sio30__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sio30__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio30__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio30__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio30__bindgen_ty_1))
    );
}
impl un_sio30__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sio30() {
    assert_eq!(
        ::core::mem::size_of::<un_sio30>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio30))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio30>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio30))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio30>())).sio30 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio30),
            "::",
            stringify!(sio30)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio30>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio30),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_txd3 {
    pub txd3: cty::c_uchar,
    pub BIT: un_txd3__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_txd3__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_txd3__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_txd3__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_txd3__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_txd3__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_txd3__bindgen_ty_1))
    );
}
impl un_txd3__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_txd3() {
    assert_eq!(
        ::core::mem::size_of::<un_txd3>(),
        1usize,
        concat!("Size of: ", stringify!(un_txd3))
    );
    assert_eq!(
        ::core::mem::align_of::<un_txd3>(),
        1usize,
        concat!("Alignment of ", stringify!(un_txd3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_txd3>())).txd3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_txd3),
            "::",
            stringify!(txd3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_txd3>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_txd3),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sdr13 {
    pub sdr13: cty::c_ushort,
    pub BIT: un_sdr13__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_sdr13__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_sdr13__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr13__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr13__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr13__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr13__bindgen_ty_1))
    );
}
impl un_sdr13__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sdr13() {
    assert_eq!(
        ::core::mem::size_of::<un_sdr13>(),
        2usize,
        concat!("Size of: ", stringify!(un_sdr13))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sdr13>(),
        2usize,
        concat!("Alignment of ", stringify!(un_sdr13))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr13>())).sdr13 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr13),
            "::",
            stringify!(sdr13)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sdr13>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sdr13),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_rxd3 {
    pub rxd3: cty::c_uchar,
    pub BIT: un_rxd3__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_rxd3__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_rxd3__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_rxd3__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_rxd3__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_rxd3__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_rxd3__bindgen_ty_1))
    );
}
impl un_rxd3__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_rxd3() {
    assert_eq!(
        ::core::mem::size_of::<un_rxd3>(),
        1usize,
        concat!("Size of: ", stringify!(un_rxd3))
    );
    assert_eq!(
        ::core::mem::align_of::<un_rxd3>(),
        1usize,
        concat!("Alignment of ", stringify!(un_rxd3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_rxd3>())).rxd3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_rxd3),
            "::",
            stringify!(rxd3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_rxd3>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_rxd3),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_sio31 {
    pub sio31: cty::c_uchar,
    pub BIT: un_sio31__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_sio31__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_sio31__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_sio31__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio31__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio31__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio31__bindgen_ty_1))
    );
}
impl un_sio31__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_sio31() {
    assert_eq!(
        ::core::mem::size_of::<un_sio31>(),
        1usize,
        concat!("Size of: ", stringify!(un_sio31))
    );
    assert_eq!(
        ::core::mem::align_of::<un_sio31>(),
        1usize,
        concat!("Alignment of ", stringify!(un_sio31))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio31>())).sio31 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio31),
            "::",
            stringify!(sio31)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_sio31>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_sio31),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_tdr00 {
    pub tdr00: cty::c_ushort,
    pub BIT: un_tdr00__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_tdr00__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_tdr00__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr00__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_tdr00__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr00__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_tdr00__bindgen_ty_1))
    );
}
impl un_tdr00__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_tdr00() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr00>(),
        2usize,
        concat!("Size of: ", stringify!(un_tdr00))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr00>(),
        2usize,
        concat!("Alignment of ", stringify!(un_tdr00))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr00>())).tdr00 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr00),
            "::",
            stringify!(tdr00)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr00>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr00),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_tdr01 {
    pub tdr01: cty::c_ushort,
    pub BIT: un_tdr01__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_tdr01__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_tdr01__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr01__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_tdr01__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr01__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_tdr01__bindgen_ty_1))
    );
}
impl un_tdr01__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_tdr01() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr01>(),
        2usize,
        concat!("Size of: ", stringify!(un_tdr01))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr01>(),
        2usize,
        concat!("Alignment of ", stringify!(un_tdr01))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr01>())).tdr01 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr01),
            "::",
            stringify!(tdr01)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr01>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr01),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_tdr01l {
    pub tdr01l: cty::c_uchar,
    pub BIT: un_tdr01l__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_tdr01l__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_tdr01l__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr01l__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_tdr01l__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr01l__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_tdr01l__bindgen_ty_1))
    );
}
impl un_tdr01l__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_tdr01l() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr01l>(),
        1usize,
        concat!("Size of: ", stringify!(un_tdr01l))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr01l>(),
        1usize,
        concat!("Alignment of ", stringify!(un_tdr01l))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr01l>())).tdr01l as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr01l),
            "::",
            stringify!(tdr01l)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr01l>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr01l),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_tdr01h {
    pub tdr01h: cty::c_uchar,
    pub BIT: un_tdr01h__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_tdr01h__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_tdr01h__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr01h__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_tdr01h__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr01h__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_tdr01h__bindgen_ty_1))
    );
}
impl un_tdr01h__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_tdr01h() {
    assert_eq!(
        ::core::mem::size_of::<un_tdr01h>(),
        1usize,
        concat!("Size of: ", stringify!(un_tdr01h))
    );
    assert_eq!(
        ::core::mem::align_of::<un_tdr01h>(),
        1usize,
        concat!("Alignment of ", stringify!(un_tdr01h))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr01h>())).tdr01h as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr01h),
            "::",
            stringify!(tdr01h)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_tdr01h>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_tdr01h),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_adcr {
    pub adcr: cty::c_ushort,
    pub BIT: un_adcr__bindgen_ty_1,
}
#[repr(C)]
#[repr(align(2))]
#[derive(Debug, Copy, Clone)]
pub struct un_adcr__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 2usize]>,
}
#[test]
fn bindgen_test_layout_un_adcr__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_adcr__bindgen_ty_1>(),
        2usize,
        concat!("Size of: ", stringify!(un_adcr__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_adcr__bindgen_ty_1>(),
        2usize,
        concat!("Alignment of ", stringify!(un_adcr__bindgen_ty_1))
    );
}
impl un_adcr__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit8(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit8(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit9(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit9(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit10(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit10(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit11(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit11(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit12(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit12(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit13(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit13(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit14(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit14(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit15(&self) -> cty::c_ushort {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u16) }
    }
    #[inline]
    pub fn set_bit15(&mut self, val: cty::c_ushort) {
        unsafe {
            let val: u16 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_ushort,
        bit1: cty::c_ushort,
        bit2: cty::c_ushort,
        bit3: cty::c_ushort,
        bit4: cty::c_ushort,
        bit5: cty::c_ushort,
        bit6: cty::c_ushort,
        bit7: cty::c_ushort,
        bit8: cty::c_ushort,
        bit9: cty::c_ushort,
        bit10: cty::c_ushort,
        bit11: cty::c_ushort,
        bit12: cty::c_ushort,
        bit13: cty::c_ushort,
        bit14: cty::c_ushort,
        bit15: cty::c_ushort,
    ) -> __BindgenBitfieldUnit<[u8; 2usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 2usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u16 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u16 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u16 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u16 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u16 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u16 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u16 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u16 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let bit8: u16 = unsafe { ::core::mem::transmute(bit8) };
            bit8 as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let bit9: u16 = unsafe { ::core::mem::transmute(bit9) };
            bit9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let bit10: u16 = unsafe { ::core::mem::transmute(bit10) };
            bit10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let bit11: u16 = unsafe { ::core::mem::transmute(bit11) };
            bit11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let bit12: u16 = unsafe { ::core::mem::transmute(bit12) };
            bit12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let bit13: u16 = unsafe { ::core::mem::transmute(bit13) };
            bit13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let bit14: u16 = unsafe { ::core::mem::transmute(bit14) };
            bit14 as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let bit15: u16 = unsafe { ::core::mem::transmute(bit15) };
            bit15 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_adcr() {
    assert_eq!(
        ::core::mem::size_of::<un_adcr>(),
        2usize,
        concat!("Size of: ", stringify!(un_adcr))
    );
    assert_eq!(
        ::core::mem::align_of::<un_adcr>(),
        2usize,
        concat!("Alignment of ", stringify!(un_adcr))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_adcr>())).adcr as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_adcr),
            "::",
            stringify!(adcr)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_adcr>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_adcr),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_adcrh {
    pub adcrh: cty::c_uchar,
    pub BIT: un_adcrh__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_adcrh__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_adcrh__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_adcrh__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_adcrh__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_adcrh__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_adcrh__bindgen_ty_1))
    );
}
impl un_adcrh__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_adcrh() {
    assert_eq!(
        ::core::mem::size_of::<un_adcrh>(),
        1usize,
        concat!("Size of: ", stringify!(un_adcrh))
    );
    assert_eq!(
        ::core::mem::align_of::<un_adcrh>(),
        1usize,
        concat!("Alignment of ", stringify!(un_adcrh))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_adcrh>())).adcrh as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_adcrh),
            "::",
            stringify!(adcrh)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_adcrh>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_adcrh),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm0 {
    pub pm0: cty::c_uchar,
    pub BIT: un_pm0__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm0__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm0__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm0__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm0__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm0__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm0__bindgen_ty_1))
    );
}
impl un_pm0__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm0() {
    assert_eq!(
        ::core::mem::size_of::<un_pm0>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm0))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm0>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm0))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm0>())).pm0 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm0),
            "::",
            stringify!(pm0)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm0>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm0),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm1 {
    pub pm1: cty::c_uchar,
    pub BIT: un_pm1__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm1__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm1__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm1__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm1__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm1__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm1__bindgen_ty_1))
    );
}
impl un_pm1__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm1))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm1>())).pm1 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm1),
            "::",
            stringify!(pm1)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm1>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm1),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm2 {
    pub pm2: cty::c_uchar,
    pub BIT: un_pm2__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm2__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm2__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm2__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm2__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm2__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm2__bindgen_ty_1))
    );
}
impl un_pm2__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm2() {
    assert_eq!(
        ::core::mem::size_of::<un_pm2>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm2))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm2>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm2))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm2>())).pm2 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm2),
            "::",
            stringify!(pm2)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm2>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm2),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm3 {
    pub pm3: cty::c_uchar,
    pub BIT: un_pm3__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm3__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm3__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm3__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm3__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm3__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm3__bindgen_ty_1))
    );
}
impl un_pm3__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm3() {
    assert_eq!(
        ::core::mem::size_of::<un_pm3>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm3))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm3>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm3))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm3>())).pm3 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm3),
            "::",
            stringify!(pm3)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm3>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm3),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm4 {
    pub pm4: cty::c_uchar,
    pub BIT: un_pm4__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm4__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm4__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm4__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm4__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm4__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm4__bindgen_ty_1))
    );
}
impl un_pm4__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm4() {
    assert_eq!(
        ::core::mem::size_of::<un_pm4>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm4))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm4>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm4))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm4>())).pm4 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm4),
            "::",
            stringify!(pm4)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm4>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm4),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm5 {
    pub pm5: cty::c_uchar,
    pub BIT: un_pm5__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm5__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm5__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm5__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm5__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm5__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm5__bindgen_ty_1))
    );
}
impl un_pm5__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm5() {
    assert_eq!(
        ::core::mem::size_of::<un_pm5>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm5))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm5>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm5))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm5>())).pm5 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm5),
            "::",
            stringify!(pm5)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm5>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm5),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm6 {
    pub pm6: cty::c_uchar,
    pub BIT: un_pm6__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm6__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm6__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm6__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm6__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm6__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm6__bindgen_ty_1))
    );
}
impl un_pm6__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm6() {
    assert_eq!(
        ::core::mem::size_of::<un_pm6>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm6))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm6>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm6))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm6>())).pm6 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm6),
            "::",
            stringify!(pm6)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm6>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm6),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm7 {
    pub pm7: cty::c_uchar,
    pub BIT: un_pm7__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm7__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm7__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm7__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm7__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm7__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm7__bindgen_ty_1))
    );
}
impl un_pm7__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm7() {
    assert_eq!(
        ::core::mem::size_of::<un_pm7>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm7))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm7>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm7))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm7>())).pm7 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm7),
            "::",
            stringify!(pm7)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm7>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm7),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm8 {
    pub pm8: cty::c_uchar,
    pub BIT: un_pm8__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm8__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm8__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm8__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm8__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm8__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm8__bindgen_ty_1))
    );
}
impl un_pm8__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
    ) -> __BindgenBitfieldUnit<[u8; 1usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 1usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let bit0: u8 = unsafe { ::core::mem::transmute(bit0) };
            bit0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let bit1: u8 = unsafe { ::core::mem::transmute(bit1) };
            bit1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let bit2: u8 = unsafe { ::core::mem::transmute(bit2) };
            bit2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let bit3: u8 = unsafe { ::core::mem::transmute(bit3) };
            bit3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let bit4: u8 = unsafe { ::core::mem::transmute(bit4) };
            bit4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let bit5: u8 = unsafe { ::core::mem::transmute(bit5) };
            bit5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let bit6: u8 = unsafe { ::core::mem::transmute(bit6) };
            bit6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let bit7: u8 = unsafe { ::core::mem::transmute(bit7) };
            bit7 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[test]
fn bindgen_test_layout_un_pm8() {
    assert_eq!(
        ::core::mem::size_of::<un_pm8>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm8))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm8>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm8))
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm8>())).pm8 as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm8),
            "::",
            stringify!(pm8)
        )
    );
    assert_eq!(
        unsafe { &(*(::core::ptr::null::<un_pm8>())).BIT as *const _ as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(un_pm8),
            "::",
            stringify!(BIT)
        )
    );
}
#[repr(C)]
#[derive(Copy, Clone)]
pub union un_pm9 {
    pub pm9: cty::c_uchar,
    pub BIT: un_pm9__bindgen_ty_1,
}
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct un_pm9__bindgen_ty_1 {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 1usize]>,
}
#[test]
fn bindgen_test_layout_un_pm9__bindgen_ty_1() {
    assert_eq!(
        ::core::mem::size_of::<un_pm9__bindgen_ty_1>(),
        1usize,
        concat!("Size of: ", stringify!(un_pm9__bindgen_ty_1))
    );
    assert_eq!(
        ::core::mem::align_of::<un_pm9__bindgen_ty_1>(),
        1usize,
        concat!("Alignment of ", stringify!(un_pm9__bindgen_ty_1))
    );
}
impl un_pm9__bindgen_ty_1 {
    #[inline]
    pub fn bit0(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit0(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit1(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit1(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit2(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit2(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit3(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit3(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit4(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit4(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit5(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit5(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit6(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit6(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn bit7(&self) -> cty::c_uchar {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bit7(&mut self, val: cty::c_uchar) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        bit0: cty::c_uchar,
        bit1: cty::c_uchar,
        bit2: cty::c_uchar,
        bit3: cty::c_uchar,
        bit4: cty::c_uchar,
        bit5: cty::c_uchar,
        bit6: cty::c_uchar,
        bit7: cty::c_uchar,
